In [1]:
# import relevant libraries

import numpy as np
import pandas as pd

In [2]:
# create a pandas dataframe containing grades on exam #1 
# for students with student id numbers 1 through 5

exam1_grades = pd.DataFrame({'SID': [1, 2, 3, 4, 5], 
                             'exam1': [86.0, 65.0, 70.0, 98.0, 89.0]})

# create a pandas dataframe containing grades on exam #2 
# for students with student id numbers 1 through 5

exam2_grades = pd.DataFrame({'SID': [1, 2, 3, 4, 5], 
                             'exam2': [80.0, 87.0, 82.0, 95.0, 96.0]})

In [3]:
# create a pandas dataframe containing grades on exam #1 and exam #2 
# for students with id numbers 1 through 7

sid_1_to_7 = pd.DataFrame({'SID': [1, 2, 3, 4, 5, 6, 7],
              'exam1': [86.0, 65.0, 70.0, 98.0, 89.0, 75.0, 56.0],
              'exam2': [80.0, 87.0, 82.0, 95.0, 96.0, 78.0, 80.0]})

# create a pandas dataframe containing grades on exam #1 and exam #2 
# for students with id numbers 8 through 10

sid_8_to_10 = pd.DataFrame({'SID': [8, 9, 10], 
                            'exam1': [90.0, 81.0, 0.0], 
                            'exam2': [87.0, 82.0, 95.0]})

In [4]:
# create a pandas dataframe containing grades on exam #1 and exam #2 
# for students 1 through 5

exams1and2 = pd.DataFrame({'exam1': [86.0, 65.0, 70.0, 98.0, 89.0],
              'exam2': [80.0, 87.0, 82.0, 95.0, 96.0]},
              index=['student1', 'student2', 'student3', 'student4', 'student5'])

# create a pandas dataframe containing grades on exam #3 for students 1 through 5

exam3 = pd.DataFrame({'exam3': [78.0, 80.0, 87.0, 89.0, 89.0]},
              index=['student1', 'student2', 'student3', 'student4', 'student5'])

In [5]:
# display exam1_grades

exam1_grades

   SID  exam1
0    1   86.0
1    2   65.0
2    3   70.0
3    4   98.0
4    5   89.0

In [6]:
# display exam2_grades

exam2_grades

   SID  exam2
0    1   80.0
1    2   87.0
2    3   82.0
3    4   95.0
4    5   96.0

In [7]:
# merge exam1_grades and exam2_grades on 'SID'
# result will be a new pandas dataframe

pd.merge(exam1_grades, exam2_grades, on='SID')

   SID  exam1  exam2
0    1   86.0   80.0
1    2   65.0   87.0
2    3   70.0   82.0
3    4   98.0   95.0
4    5   89.0   96.0

In [8]:
# display sid_1_to_7

sid_1_to_7

   SID  exam1  exam2
0    1   86.0   80.0
1    2   65.0   87.0
2    3   70.0   82.0
3    4   98.0   95.0
4    5   89.0   96.0
5    6   75.0   78.0
6    7   56.0   80.0

In [9]:
# display sid_8_to_10

sid_8_to_10

   SID  exam1  exam2
0    8   90.0   87.0
1    9   81.0   82.0
2   10    0.0   95.0

In [10]:
# concatenate sid_1_to_7 and sid_8_to_10 along the rows (along axis 0)
# result will be a new pandas dataframe

pd.concat([sid_1_to_7, sid_8_to_10], axis=0)

   SID  exam1  exam2
0    1   86.0   80.0
1    2   65.0   87.0
2    3   70.0   82.0
3    4   98.0   95.0
4    5   89.0   96.0
5    6   75.0   78.0
6    7   56.0   80.0
0    8   90.0   87.0
1    9   81.0   82.0
2   10    0.0   95.0

In [11]:
# display exams1and2

exams1and2

          exam1  exam2
student1   86.0   80.0
student2   65.0   87.0
student3   70.0   82.0
student4   98.0   95.0
student5   89.0   96.0

In [12]:
# display exam3

exam3

          exam3
student1   78.0
student2   80.0
student3   87.0
student4   89.0
student5   89.0

In [15]:
# concatenate exams1and2 and exam3 along the columns (along axis 1)
# result will be a new pandas dataframe

pd.concat([exams1and2, exam3], axis=1)

          exam1  exam2  exam3
student1   86.0   80.0   78.0
student2   65.0   87.0   80.0
student3   70.0   82.0   87.0
student4   98.0   95.0   89.0
student5   89.0   96.0   89.0